---
type: LogicalAndFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# LogicalAndFilter

`Autodesk.Revit.DB.LogicalAndFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LogicalAndFilter | — | `` |
| Method | PassesFilter | — | `` |